Terraform Plan:
```data.aws_route53_zone._127cyber-name: Reading...
aws_acm_certificate._127cyber_wildcard_cert: Refreshing state... [id=arn:aws:acm:ap-southeast-2:941133421128:certificate/8a3fa3f5-d088-40bc-acdd-cbbdf26a3cd6]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-06a74ec7f77c3e70d]
aws_iam_role.ec2_instance_role: Refreshing state... [id=ec2-instance-role-generic]
aws_vpc.main: Refreshing state... [id=vpc-0dd2fa7e493c2d1d7]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=ec2-instance-role-generic-20240224034341335600000004]
aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=ec2-instance-role-generic-20240224034341068200000003]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-instance-profile]
data.aws_route53_zone._127cyber-name: Read complete after 0s [id=Z03093112GERZ97ION6VA]
aws_route53_record._127cyber_wildcard_cert_validation["*.127cyber.com"]: Refreshing state... [id=Z03093112GERZ97ION6VA__138665dd27ee909427cb33f3f8ce3b81.127cyber.com._CNAME]
aws_acm_certificate_validation._127cyber_wildcard_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_internet_gateway.gw: Refreshing state... [id=igw-0f2fc9f6ea764fef2]
aws_subnet.private2: Refreshing state... [id=subnet-0bb24ce7b57f11a4e]
aws_subnet.public1: Refreshing state... [id=subnet-08bf80caf918933b3]
aws_subnet.public2: Refreshing state... [id=subnet-0e195ef9c3da6dc03]
aws_lb_target_group.tg_1515: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1515/be94bcbe8c5e46d0]
aws_lb_target_group.tg_55000: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-55000/aed66517d6efb554]
aws_lb_target_group.wazuh_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/wazuh-tg/37aacca1f487e185]
aws_subnet.private1: Refreshing state... [id=subnet-0818a00226f9ede92]
aws_lb_target_group.tg_1514: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1514/472cbbfaed15f937]
aws_lb_target_group.graylog_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/graylog-tg/bc78d2759b48afa3]
aws_security_group.all: Refreshing state... [id=sg-01d4c90dd2abaa4a5]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/grafana-tg/67e0308cdd1fd72f]
aws_route_table.public: Refreshing state... [id=rtb-0e96cd9978cf3b5de]
aws_nat_gateway.nat: Refreshing state... [id=nat-007d6fbfd8cb73c4a]
aws_lb.nlb_wazuh: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:loadbalancer/net/wazuh-nlb/b57b44e684040335]
aws_lb.soc_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:loadbalancer/app/soc-alb/7167088de8f11630]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0f3c107ed482e0fce]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-0e07e41a1de38dcf6]
aws_route_table.private: Refreshing state... [id=rtb-08636ea2b68e2edc0]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-081e0d8387c6bd91e]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-00f8c755f122060ac]
aws_lb_listener.listener_1514: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/b57b44e684040335/39b91ef407e7718b]
aws_lb_listener.listener_55000: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/b57b44e684040335/6e500a4694cae009]
aws_lb_listener.listener_1515: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/b57b44e684040335/79207b424e9511e1]
aws_route53_record.nlb_dns: Refreshing state... [id=Z03093112GERZ97ION6VA_listen.127cyber.com_CNAME]
aws_route53_record.wazuh_record: Refreshing state... [id=Z03093112GERZ97ION6VA_wazuh.127cyber.com_A]
aws_lb_listener.https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/app/soc-alb/7167088de8f11630/2fc9ec04482afd08]
aws_lb_listener_rule.wazuh_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener-rule/app/soc-alb/7167088de8f11630/2fc9ec04482afd08/e3a4bb15f56c9424]
aws_lb_listener_rule.grafana_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener-rule/app/soc-alb/7167088de8f11630/2fc9ec04482afd08/c239d4f041d3e7f7]
aws_lb_listener_rule.graylog_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener-rule/app/soc-alb/7167088de8f11630/2fc9ec04482afd08/f3da53d0cd7286c9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_target_group_attachment.attach_wazuh_1514 will be created
  + resource "aws_lb_target_group_attachment" "attach_wazuh_1514" {
      + id               = (known after apply)
      + port             = 1514
      + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1514/472cbbfaed15f937"
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.attach_wazuh_1515 will be created
  + resource "aws_lb_target_group_attachment" "attach_wazuh_1515" {
      + id               = (known after apply)
      + port             = 1515
      + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1515/be94bcbe8c5e46d0"
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.attach_wazuh_55000 will be created
  + resource "aws_lb_target_group_attachment" "attach_wazuh_55000" {
      + id               = (known after apply)
      + port             = 55000
      + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-55000/aed66517d6efb554"
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.wazuh_attachment will be created
  + resource "aws_lb_target_group_attachment" "wazuh_attachment" {
      + id               = (known after apply)
      + port             = 443
      + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/wazuh-tg/37aacca1f487e185"
      + target_id        = (known after apply)
    }

  # module.ec2_wazuh.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-09ccb67fcbf1d625c"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ec2-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "c5.xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0818a00226f9ede92"
      + tags                                 = {
          + "Environment" = "prod"
          + "Name"        = "wazuh"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "Name"        = "wazuh"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "bc4cc89944904261ad301c1137a31b7e363a3cae"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "wazuh"
        }
      + vpc_security_group_ids               = [
          + "sg-01d4c90dd2abaa4a5",
        ]

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```